[
  {
    "Title": "Donald Trump does not have presidential immunity, US court rules",
    "Content": "The former president loses a landmark legal bid to shield him from charges of election fraud.",
    "Link": "https://www.bbc.co.uk/news/world-us-canada-68026175?at_medium=RSS&at_campaign=KARANGA"
  },
  {
    "Title": "Stormont: Michelle O'Neill makes history as nationalist first minister",
    "Content": "The Sinn Féin vice-president hails \"a new dawn\" as a power-sharing government returns in NI.",
    "Link": "https://www.bbc.co.uk/news/uk-northern-ireland-politics-68180505?at_medium=RSS&at_campaign=KARANGA"
  },
  {
    "Title": "Lloyd Austin: 'I did not handle this right'",
    "Content": "The US defence secretary said he should have informed the president and public of his cancer diagnosis.",
    "Link": "https://www.bbc.co.uk/news/world-us-canada-68172214?at_medium=RSS&at_campaign=KARANGA"
  },
  {
    "Title": "Why these Arab Americans say Biden has lost their vote",
    "Content": "The US president's support for Israel has left some Arab American voters feeling alienated.",
    "Link": "https://www.bbc.co.uk/news/world-us-canada-68172215?at_medium=RSS&at_campaign=KARANGA"
  },
  {
    "Title": "McCarthy makes plea for Republicans to back debt ceiling plan",
    "Content": "Speaker Kevin McCarthy made a plea to House Republicans during a closed-door meeting Tuesday morning to back his debt ceiling plan, telling them that although it doesn't have to include everything they want, it will help get him to the negotiating table with President Joe Biden. ",
    "Link": "https://www.cnn.com/2023/04/18/politics/mccarthy-debt-limit-plan/index.html"
  },
  {
    "Title": "Meet the woman steering Biden's bipartisan winning streak on Capitol Hill",
    "Content": "The Biden administration managed to rack up a long list of major legislative wins in its first two years despite facing one of the most closely-divided Congresses in history.\nFrom bipartisan action on infrastructure, gun safety and same-sex marriage to party-line bills tackling climate change and expanding health care coverage, it's a record President Joe Biden and Democrats on the ballot were all eager to tout on the campaign trail during the midterms. ",
    "Link": "https://www.cnn.com/2022/12/11/politics/louisa-terrell-legislative-director/index.html"
  },
  {
    "Title": "The notable legal clouds that continue to hang over Donald Trump",
    "Content": "All eyes are on former President Donald Trump, who has launched another White House bid. ",
    "Link": "https://www.cnn.com/2022/11/15/politics/donald-trump-investigations-lawsuits/index.html"
  },
  {
    "Title": "Everything you need to know about Biden's student loan forgiveness program",
    "Content": "President Joe Biden's federal student loan forgiveness program, which promises to deliver up to $20,000 of debt relief for millions of borrowers, is on hold indefinitely as legal challenges work their way through the courts. ",
    "Link": "https://www.cnn.com/2022/08/31/politics/biden-student-loan-forgiveness-faq/index.html"
  },
  {
    "Title": "",
    "Content": "President Joe Biden admonished former President Donald Trump and Republicans who are derailing a long-negotiated border and national security bill that is expected to fail in the Senate. ",
    "Link": "https://www.cnn.com/videos/politics/2024/02/06/joe-biden-donald-trump-border-bill-cnc-vpx.cnn"
  },
  {
    "Title": "",
    "Content": "CNN chief national correspondent John King heads to South Carolina ahead of its Republican primary to speak with voters about the race between the state's former governor, Nikki Haley, and former president Donald Trump.",
    "Link": "https://www.cnn.com/videos/politics/2024/02/06/john-king-south-carolina-voters-haley-trump-vpx.cnn"
  },
  {
    "Title": "",
    "Content": "CNN senior legal analyst Elie Honig breaks down an appeals court ruling that former President Donald Trump does not have blanket presidential immunity. The ruling is a major blow to Trump's defense in the federal election subversion case brought by special counsel Jack Smith. ",
    "Link": "https://www.cnn.com/videos/politics/2024/02/06/trump-immunity-ruling-appeals-court-honig-vpx.cnn"
  },
  {
    "Title": "",
    "Content": "During a radio interview on \"The Dan Bongino Show,\" former President Donald Trump said he would like to debate President Joe Biden \"immediately.\" Biden, however, seemed to just laugh the idea off when asked about it by reporters. ",
    "Link": "https://www.cnn.com/videos/politics/2024/02/06/trump-challenges-biden-presidential-debate-cnntm-ldn-vpx.cnn"
  },
  {
    "Title": "",
    "Content": "CNN's Abby Phillip breaks down RNC chief Ronna McDaniel's loyalty toward former President Donald Trump despite his public doubts about her future after a series of election-year losses. ",
    "Link": "https://www.cnn.com/videos/politics/2024/02/06/rnc-chief-ronna-mcdaniel-trump-nn-vpx.cnn"
  },
  {
    "Title": "",
    "Content": "New York Times reporter and CNN senior political analyst Maggie Haberman joins Jake Tapper to discuss some of the legal woes former President Trump is facing this week.",
    "Link": "https://www.cnn.com/videos/politics/2024/02/05/trump-legal-woes-haberman-tapper-sot-lead-vpx.cnn"
  },
  {
    "Title": "Federal Appeals Court Rejects Trump’s Claim of Absolute Immunity",
    "Content": "Former President Donald J. Trump is expected to continue his appeal to the Supreme Court.",
    "Link": ""
  },
  {
    "Title": "Nevada’s Weird Primary and Caucuses: What to Watch For",
    "Content": "Former President Donald J. Trump is expected to receive all 26 delegates at stake in the Nevada contest, with nobody contesting him in Thursday’s caucuses.",
    "Link": ""
  },
  {
    "Title": "There’s a Tax Season Villain, and It’s Not the I.R.S.",
    "Content": "For decades, American presidents have promised free and easy tax filling. Why have they consistently failed to deliver?",
    "Link": ""
  },
  {
    "Title": "Texas Company Was Behind Voter Robocalls That Impersonated Biden, N.H. Says",
    "Content": "President Biden during a campaign event in Las Vegas on Sunday. Robocalls impersonating Mr. Biden were made to New Hampshire voters ahead of the state’s primary last month.",
    "Link": ""
  },
  {
    "Title": "Federal Appeals Court Rejects Trump’s Claim of Absolute Immunity",
    "Content": "Former President Donald J. Trump is expected to continue his appeal to the Supreme Court.",
    "Link": ""
  },
  {
    "Title": "Nevada’s Weird Primary and Caucuses: What to Watch For",
    "Content": "Former President Donald J. Trump is expected to receive all 26 delegates at stake in the Nevada contest, with nobody contesting him in Thursday’s caucuses.",
    "Link": ""
  },
  {
    "Title": "Group in Michigan Urges Protest Vote Against Biden Over Israel-Gaza War",
    "Content": "President Biden speaking to autoworkers in Michigan, which will be a key battleground state in November.",
    "Link": ""
  },
  {
    "Title": "Biden Calls Los Angeles Mayor and Promises Aid for Storm Damage",
    "Content": "President Biden arrived at Joint Base Andrews, Md., on Monday, after campaign events.",
    "Link": ""
  },
  {
    "Title": "Trump Couldn’t Shut Down the Border. Can Biden?",
    "Content": "President Biden has not tested the limits of immigration law, unlike his immediate predecessor, Donald J. Trump.",
    "Link": ""
  },
  {
    "Title": "Biden Threatens to Veto Bill That Would Help Israel but Not Ukraine",
    "Content": "President Biden departing Las Vegas on Monday. The Biden administration said the president would veto the House bill if it came to his desk.",
    "Link": ""
  },
  {
    "Title": "How Trump Uses the Power and Imagery of His Presidency",
    "Content": "Former President Donald J. Trump leaves a campaign rally while surrounded by Secret Service agents in Durham, N.H., in December.",
    "Link": ""
  },
  {
    "Title": "The Retribution Presidency",
    "Content": "Supporters lining up to see Former President Donald J. Trump speak in Concord, N.H.",
    "Link": ""
  },
  {
    "Title": "Biden Meets With Culinary Workers on Eve of Nevada Primary",
    "Content": "President Biden met with members of the Culinary Workers Union in Las Vegas on Monday.",
    "Link": ""
  },
  {
    "Title": "Federal Appeals Court Rejects Trump’s Claim of Absolute Immunity",
    "Content": "Former President Donald J. Trump is expected to continue his appeal to the Supreme Court.",
    "Link": ""
  },
  {
    "Title": "The Trump Election Immunity Ruling, Annotated",
    "Content": "A three-judge appeals court panel rejected former President Donald J. Trump’s claim that he was immune to criminal charges. Read its decision, with Times analysis.",
    "Link": ""
  },
  {
    "Title": "What to Watch in Nevada’s Weird Election Week",
    "Content": "Former President Donald J. Trump is expected to receive all 26 delegates at stake in the Nevada contest, with nobody contesting him in Thursday’s caucuses.",
    "Link": ""
  },
  {
    "Title": "Texas Company Was Behind Voter Robocalls That Impersonated Biden, N.H. Says",
    "Content": "President Biden during a campaign event in Las Vegas on Sunday. Robocalls impersonating Mr. Biden were made to New Hampshire voters ahead of the state’s primary last month.",
    "Link": ""
  },
  {
    "Title": "Group in Michigan Urges Protest Vote Against Biden Over Israel-Gaza War",
    "Content": "President Biden speaking to autoworkers in Michigan, which will be a key battleground state in November.",
    "Link": ""
  },
  {
    "Title": "Biden Has Openings for a Comeback on Two Weak Points",
    "Content": "President Biden has good economic news to promote and a possible border tactic to deploy. ",
    "Link": ""
  },
  {
    "Title": "Trump Couldn’t Shut Down the Border. Can Biden?",
    "Content": "President Biden has not tested the limits of immigration law, unlike his immediate predecessor, Donald J. Trump.",
    "Link": ""
  },
  {
    "Title": "Biden Threatens to Veto Bill That Would Help Israel but Not Ukraine",
    "Content": "President Biden departing Las Vegas on Monday. The Biden administration said the president would veto the House bill if it came to his desk.",
    "Link": ""
  },
  {
    "Title": "How Trump Uses the Power and Imagery of His Presidency",
    "Content": "Former President Donald J. Trump leaves a campaign rally while surrounded by Secret Service agents in Durham, N.H., in December.",
    "Link": ""
  },
  {
    "Title": "The Retribution Presidency",
    "Content": "Supporters lining up to see Former President Donald J. Trump speak in Concord, N.H.",
    "Link": ""
  },
  {
    "Title": "Biden Meets With Culinary Workers on Eve of Nevada Primary",
    "Content": "President Biden met with members of the Culinary Workers Union in Las Vegas on Monday.",
    "Link": ""
  },
  {
    "Title": "Meta Calls for Industry Effort to Label A.I.-Generated Content",
    "Content": "Nick Clegg, president of global affairs and communications at Meta, is pushing other companies to help identify A.I.-created content.",
    "Link": ""
  },
  {
    "Title": "President of Powerful Service Workers Union Will Step Down",
    "Content": "Mary Kay Henry, the president of the Service Employees International Union since 2010, said she would not run for another term.",
    "Link": ""
  },
  {
    "Title": "Coping With the Loss of a Pet? They Can Offer Grief Support.",
    "Content": "The death of a pet can leave its owner with complex feelings that they may struggle to process alone. “People sometimes think they’re going crazy,” said Colleen Rolland, the president of the Association for Pet Loss and Bereavement.",
    "Link": ""
  },
  {
    "Title": "Biden to Sit Out Super Bowl Interview",
    "Content": "President Biden at his campaign headquarters in Delaware on Saturday. In a tradition dating to 2009, presidents typically record an interview with the network broadcasting the Super Bowl.",
    "Link": ""
  },
  {
    "Title": "For Biden, a Sunny Economy Could Finally Be a Potential Gain",
    "Content": "President Biden has struggled to sell voters on the positive signs in the economy under his watch.",
    "Link": ""
  }
]
